#include <stdio.h>

int main() {
    double x = 1.0, y = 2.0, z;
    printf("1. x = %.1f, y = %.1f, z = ไม่มีค่า\n", x, y);

    x = y + 5.0;
    printf("2. x = y + 5.0 = %.1f + 5.0 = %.1f\n", y, x);
    printf(" x = %.1f, y = %.1f, z = ไม่มีค่า\n", x, y);

    y = x / 2.0;
    printf("3. y = x / 2.0 = %.1f / 2.0 = %.1f\n", x, y);
    printf(" x = %.1f, y = %.1f, z = ไม่มีค่า\n", x, y);

    y = (x * 3.0) + 4.0;
    printf("4. y = (x * 3.0) + 4.0 = (%.1f * 3.0) + 4.0 = %.1f\n", x, y);
    printf(" x = %.1f, y = %.1f, z = ไม่มีค่า\n", x, y);

    x = -0.5 - y;
    printf("5. x = -0.5 - y = -0.5 - %.1f = %.1f\n", y, x);
    printf(" x = %.1f, y = %.1f, z = ไม่มีค่า\n", x, y);

    z = x + y;
    printf("6. z = x + y = %.1f + %.1f = %.1f\n", x, y, z);
    printf(" x = %.1f, y = %.1f, z = %.1f\n", x, y, z);

    return 0;
}
//1. ในโปรแกรมที่สอง (w06-02-02) เราใช้ตัวแปรประเภท double ทุกตัว ทำให้สามารถเก็บค่าทศนิยมได้
//2. การคำนวณในโปรแกรมที่สองจะได้ผลลัพธ์เป็นทศนิยมทั้งหมด